from newparser import info_pars

act = info_pars()


def aktirovka(n):
    return (f'Здравствуйте, <b><i>{n}</i></b>🙂\n-----------------------------------------\nИнформация об актировках и погоде на данный момент:\
    \n{act[0][2]}:\t\t\t<b>{act[0][3]}</b>\v\
    \n{act[0][4]}:\t\t\t<b>{act[0][5]}</b>\v\
    \n{act[0][6]}:\t\t\t<b>{act[0][7]}</b>\v\
    \n{act[0][8]}:\t\t\t<b>{act[0][9]}</b>\v\n-----------------------------------------\
    \n{act[1].strip()}\n-----------------------------------------\
    \n{act[2].strip()}\n')
